import AppLayoutClient from '@/components/app-layout/AppLayoutClient';
import { getMetaData } from '@/core/utils/meta';
import type { Metadata } from 'next';
import React from 'react';

export const metadata: Metadata = getMetaData({
  title: {
    default: 'Тестирование',
    template: '%s | gradiorAI. Тестирование.',
  },
  description:
    'Настройте тесты под себя. Выбирайте направление, в котором хотите проверить свои навыки и приступайте к тестированию!',
  keywords: [
    'Gradior AI',
    'Gradior AI Тестирование',
    'подготовка к собеседованию',
    'техническое интервью',
    'AI тесты',
    'интервью чат',
    'AI генератор вопросов',
    'программирование',
    'вакансия',
    'Frontend собеседование',
    'Backend интервью',
    'DevOps интервью',
    'IT собеседования',
    'тесты',
    'подготовка к собеседованию',
    'вопросы к собеседованию',
    'генерация вопросов чатом GPT',
    'Gradior',
    'gradior ai',
    'IT',
    'проверка знаний',
    'сервис для генерации тестов по программированию',
    'тестовые вопросы по программированию',
    'вопросы для фронтенд разработчика',
    'автоматическая генерация вопросов',
  ],
});

// export const metadata: Metadata = {
//   title: {
//     default: 'Тестирование',
//     template: '%s | Gradior. Тестирование.',
//   },
//   description:
//     'Настройте тесты под себя. Выбирайте направление, в котором хотите проверить свои навыки и приступайте к тестированию!',
//   keywords: [
//     'Gradior AI',
//     'Gradior AI Тестирование',
//     'подготовка к собеседованию',
//     'техническое интервью',
//     'AI тесты',
//     'интервью чат',
//     'AI генератор вопросов',
//     'программирование',
//     'вакансия',
//     'Frontend собеседование',
//     'Backend интервью',
//     'DevOps интервью',
//     'IT собеседования',
//     'тесты',
//     'подготовка к собеседованию',
//     'вопросы к собеседованию',
//     'генерация вопросов чатом GPT',
//     'Gradior',
//     'gradior ai',
//     'IT',
//     'проверка знаний',
//     'сервис для генерации тестов по программированию',
//     'тестовые вопросы по программированию',
//     'вопросы для фронтенд разработчика',
//     'автоматическая генерация вопросов',
//   ],
// };

const TestsLayout: React.FC<Readonly<{ children: React.ReactNode }>> = ({ children }) => {
  return <AppLayoutClient withState>{children}</AppLayoutClient>;
};

export default TestsLayout;
